{
    "Reviews": [
        {
            "name": "HARSHITH SHETTY",
            "content": "I strongly recomended to join the institute X-workZ is a great platform for the freshers to gain knowledge and have good hands-on on technical skills. And there is free Java course for a month. To be honest I have gained lot of knowledge regarding java. Trainers are really good and their teaching is industry manner. Training is not only concerned about finishing the topics but they are concerned about communication skills, aptitude skills, interview skills etc. My personal experience was really good everyone is supporting for our success. They encourage more to get placed in a company.",
            "rating": "5",
            "review_url": "https://goo.gl/maps/cdXHjQWApH3SvgSp6"
        },
        {
            "name": "Chandana S",
            "content": "My overall experience in X-Workz was really good. For all freshers who are looking to start their IT Career I recommend this institute. One of the best institute to learn java. All the trainers are IT professionals they provide more practical knowledge which are at industry level standards. Assignments were given on regular basis which helped me a lot to learn the technologies. Constant presentations and mock interviews gave me a boost of confidence for interview preparation.Thanks to X-Workz",
            "rating": "5",
            "review_url": "https://goo.gl/maps/GmxWtiEsNr4atNPp7"
        },
        {
            "name": "Mahendra M",
            "content" : "My overall experience in X-Workz was really good.For all freshers who are looking to start their IT Career I recommend this institute. One of the best institute to learn java. All the trainers are IT professionals they provide more practical knowledge which are at industry level standards. Assignments were given on regular basis which helped me a lot to learn the technologies. Constant presentations and mock interviews gave me a boost of confidence for interview preparation. Thanks to X-Workz",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/Jp2N9m3N8fwxPp1X9"
        },
        {
            "name": "Shilpa B V",
            "content" : " ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/FPeXmzBJNBaoRmPC6"

        },
        {
            "name": "Sharath",
            "content" : "I My self Sharath C, My overall experience in X-Workz was really amazing .For all freshers who are looking to start their IT Career I recommend this institute. One of the best institute to learn java. All the trainers are IT professionals they provide more practical knowledge band aslo they will help u if u have facing anything difficulties during learning time . Assignments were given on regular basis which helped me a lot to learn the technologies. Constant presentations and mock interviews gave me a boost of confidence for interview preparation. I would like to thank u all the trainers .I would like to thank HR team of X-Workz i.e Akshara sir ,Vinay sir who have given many opportunities and helped us to clear the interviews and they are very friendly. ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/dFSqrEWGjDkittGv5"

        },
        {
            "name": "Rohini HN",
            "content" : " Firstly I would like to thank Xworkz, I got to know it from one of my friends and then I get into it I would especially like to thank omkar sir  because he guided all the ways to gain the required technical knowledge and I can say he is a pioneer of introducing new teaching methods with practical stuff,and as HR's Vinay sir and Akshara sir  guided a lot to clear interview process, interview preparation, by arranging mock interviews and daily presentations as well...",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/rPUPXwCWSP6mCGBKA"

        },
        {
            "name": "Vinay H P",
            "content" : "  ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/WJppKcrEM3Q9gRxe9"

        },
        {
            "name": "Pradeep.v",
            "content" :"  ",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/qLqsbjdkRHmaNq8P6"

        },
        {
            "name": "Manoj G",
            "content" :"Anyone working in Java should take this course. Because of the wide range of topics covered in this course, I feel as though my knowledge of Java is now more well-rounded. The tasks were excellent. Hard at times, but really informative. Practice is the only thing that works. Exercises allowed for more time to be spent on the interesting aspects. I'm highly thankful.  ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/YP7oNnbeci18smbS9"

        },
        {
            "name": "Anil Kumar",
            "content" :"My overall experience was good, if ur a fresher then go with x-workz",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/PaFnJXbRuNmcdrxX7"

        },
        {
            "name": "Pooja Lakshmi R",
            "content" :"Very nice institute....the lectures are very friendly. They provide certificate after 2 months free course completion. No one will give free course especially java but they are giving good course to everyone. Thank you for your support",
            "rating" :"3",
            "review_url" : "https://goo.gl/maps/HEW5MR7ERvBtfUT"

        },
        {
            "name": "Praveen Nirmal Kumar J",
            "content":"I have Trained here about 2 months and Team teaching and guidance to the job is good. If anyone looking for developing course can consider X-workz",      
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/e1hMoYdXgjFXHaCJ7"

        },
        {
            "name": "Hanamant Choori",
            "content":"X-workz is a good platform for learning Technical skills and improving the new skills towards technology. All the trainers are excellent and working in IT industries. Trainers provides practical knowledge and implements IT standards .Presentation are conducted on daily basis to improve the communication skills, logical and technical skills. And also they provide ADVANCE JAVA like JDBC,HIBERNATE and SPRING which is help to survive in IT field .Mock interviews are conducted it helps to build our confident towards interview. Also X-workz family for  their support and encouragement.",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/xqsMogD1LgqRznc7A"

        },
        {
            "name": "Kiran Kumar BJ",
            "content":"They are they are practically teaching very well comparatively other institutions",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/RvFFctFyd6oAKTyz5"

        },
        {
            "name": "Shivu M",
            "content":"I am Shivu, My overall experience in X-Workz was really good.  I strongly recomended to join the institute X-workZ is a great platform for the freshers to gain knowledge and have good hands-on on technical skills.  One of the best institute to learn java.the trainers are excellent in teaching which helps us understand the concepts and They encourage more to get placed in a company.",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/PexErNa7oGvWmWjn6"

        },
        {
            "name": "Chandrashekar M",
            "content":"The xworkz family is very good and all faculties are friendly one disadvantage is  There is no time sence of faculties ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/QeqRZj9nNXzFm1WeA"

        },
        {
            "name": "Veenas",
            "content":"it is a good learning envirnoment and also useful to get good knowledge about technical skills. ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/CdrrG5REyPAKC7js9"

        },
        {
            "name": "Shilpa U",
            "content":"Xworkz is very good Institute, and it has very. Good teaching technology, class are so good and very helpful full, and good environment to develop our carrier",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/Votg5XrbpnTDno8T9"

        },
        {
            "name": "Anushad Anu",
            "content":" I am gain the knowledge in Java and web classes",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/xzz8qL3W5KQqHxGT9"

        },
        {
            "name": "Manu naik S",
            "content":" Xworkz ODC institution bought an good opportunity for my career growth and I am pleased with Mr. Dev sir, Hopefully Xworkz ODC institution is an Golden opportunity for people who are planning to start their career in IT. In Xworkz ODC institution the trainers are well expert and have real time experience. And the Admin team in Xworkz ODC institution are very responsible and they'll be fallowing each and every students till our course completion and gives proper response for us. I really appreciate it. Thank you Mr. Dev sir and Xworkz ODC institution. People if you're planning to start their career in IT I strongly suggest it's better you can approach Xworkz ODC institution.",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/FrRK3agxjSPPzNVW8"

        },
        {
            "name": "Pooja S",
            "content":"This is a best platform to learn Java and other technologies. All the trainers are excellent in teaching which is helps to understand better with industry level coding. Then the presentation session which helps to  builder our confidence level. I would like to thank all trainers and HR team for support.",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/R9pKeRYmzDXKRxz3A"

        },
        {
            "name": "Abhighjna Chandavarkar",
            "content":"Good experience and friendly faculties. Good place to learn.",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/kJp7zdg19vWcZXKr7"

        },
        {
            "name": "SPOORTHY V S",
            "content":"X-Workz is one of the best institute to learn Programming language. Not for only Technical background students they give so many opportunities to non-technical background students and help us understand the concepts thoroughly. Mock interviews taken by the trainers extremely helped me for the interview. I like to thank all trainers for giving good knowledge. ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/BeAfcA1JkaCLmV9B6"

        },
        {
            "name": "Darshan HA",
            "content":" ",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/MDS9LYeLkWEqias56"

        },
        {
            "name": "akash y",
            "content":"One of the best institute to give hands-on experience along with the teaching. Industry level training by best industry experienced trainers in affordable prices for students who seek to be perfect. Presentations for the students who have stage fear. Helped to build my confidence for the interviews. Got to learn more things and got placed in one of the top leading company. Thanks to xworkz ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/dGbpaCwVSjoD2g6a8"

        },
        {
            "name": "Agasthya Ashu",
            "content":" ",
            "rating" :"4",
            "review_url" : "https://goo.gl/maps/DHkpPrL9GoLKweC69"

        },
        {
            "name": "Prashanth Reddy",
            "content":"I am Prashanth, BCA 2019 Passout. Now I am working in software company as a Software developer. I have done Java Enterprise Application development training at X-Workz. The training was very useful to get this job easily.with updated syllabus.Trainers teaching was excellent. The classes are scheduled properly and their way of approach is very nice.and also they are conducting presentation classes which boosts your confidence level and weekly mock interview to crack the interview easily. Overall, I feel the training is really worth for my money, time and effort spent here.They are also providing 100% placements. X-Workz  is the best place to learn Java in Bangalore. I Strongly Recommend students to join X-Workz to kick start IT Career. ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/BKZAVzevTLKWaEMCA"

        },
        {
            "name": "Gowda C K",
            "content":"It's a very good Institute,  and platform to learn java .Trainers are really  excellent and experienced in the industry as  well. They mainly focus on the practical skills and also they concentrate on individual student.I have gained lot of knowledge in java .Training is not only on java they also concentrate on aptitude skills,communication skills , interview skills etc.. my overall experience was good and i strongly recommend to join this Institute ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/iVeDwcvVhCVfvWNx5"

        },
        {
            "name": "Ashok Kumar",
            "content":"It's one of the best opportunity for the freshs of those who build  good career in IT fild. and also good supporting staff members. Omkar sir, and lokesh sir, technical skills was amazing and  Omkar sir  the way of explaining the concept teaching is really good     I am lucky to part of x-workz family   And recently omkar sir was married congratulations sir happy married life",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/EN9dtxCgWDufCAzJ6"

        },
        {
            "name": "manish mullur",
            "content":"Xworkz is one of the best software training institute in Bangalore.Trainers are very knowledgeable and friendly and very patient in explaining the concepts.And provides better placement opportunities.",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/nwQicJ2UN3jQ8qtd8"

        },
        {
            "name": "pradeep kalleshwar",
            "content":" ",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/hSswhQM7XSkuuS477"

        },
        {
            "name": "Yogesh T S",
            "content":" A great institute to learn java programming, here you will be made industry ready. They'll teach all the necessary softwares thoroughly and if any doubts occur we can reach out to them personally. Overall i would summarize that it's the best institute to be a full stack developer",
            "rating" :"5",
            "review_url" : "https://goo.gl/maps/HxVWAbLdcPDdUCgF8"

        }
    ]
}
