{
    "Questions": [ 
		{
		"question": "How many objects of a servlet is created?"
		},  
		{
		"question": "What is the life-cycle of a servlet?"
		},  
		{
		"question": "What are the life-cycle methods for a servlet?"
		},  
		{
		"question": "Who is responsible to create the object of servlet?"
		},  
		{
		"question": "When servlet object is created?"
		},  
		{
		"question": "What is difference between Get and Post method?"
		},  
		{
		"question": "What is difference between PrintWriter and ServletOutputStream?"
		},  
		{
		"question": "What is difference between GenericServlet and HttpServlet?"
		},  
		{
		"question": "What is servlet collaboration?"
		},  
		{
		"question": "What is the purpose of RequestDispatcher Interface?"
		},  
		{
		"question": "Can you call a jsp from the servlet?"
		},  
		{
		"question": "Difference between forward() method and sendRedirect() method ?"
		},  
		{
		"question": "What is difference between ServletConfig and ServletContext?"
		},  
		{
		"question": "What is Session Tracking?"
		},  
		{
		"question": "What are Cookies?"
		},  
		{
		"question": "What is difference between Cookies and HttpSession?"
		},  
		{
		"question": "What is filter?"
		},  
		{
		"question": "How can we perform any action at the time of deploying the project?"
		},  
		{
		"question": "What is the disadvantage of cookies?"
		},  
		{
		"question": "How can we upload the file to the server using servlet?"
		},  
		{
		"question": "What is load-on-startup in servlet?"
		},  
		{
		"question": "What if we pass negative value in load-on-startup?"
		},  
		{
		"question": "What is war file?"
		},  
		{
		"question": "How to create war file?"
		},  
		{
		"question": "What are the annotations used in Servlet 3?"
		},  
		{
		"question": "Which event is fired at the time of project deployment and undeployment?"
		},  
		{
		"question": "Which event is fired at the time of session creation and destroy?"
		},  
		{
		"question": "Which event is fired at the time of setting, getting or removing attribute from application scope?"
		},  
		{
		"question": "What is the use of welcome-file-list?"
		},  
		{
		"question": "What is the use of attribute in servlets?"
		}
	]
}